mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/s6e2d3xg.svd
        <!-- REGISTER "FCSWH_CTL" -->
        <register>
          <name>FCSWH_CTL</name>
          <description>Frequency detection window setting register [W]</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FWH" -->
            <field>
              <name>FWH</name>
              <description>Frequency detection window setting bits (Upper)</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCSWL_CTL" -->
        <register>
          <name>FCSWL_CTL</name>
          <description>Frequency detection window setting register [W]</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FWL" -->
            <field>
              <name>FWL</name>
              <description>Frequency detection window setting bits (Lower)</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCSWD_CTL" -->
        <register>
          <name>FCSWD_CTL</name>
          <description>Frequency detection counter register [W]</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FWD" -->
            <field>
              <name>FWD</name>
              <description>Frequency detection count data</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBWDT_CTL" -->
        <register>
          <name>DBWDT_CTL</name>
          <description>Debug Break Watchdog Timer Control Register [W]</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DPHWBE" -->
            <field>
              <name>DPHWBE</name>
              <description>HW-WDG debug mode break bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DPSWBE" -->
            <field>
              <name>DPSWBE</name>
              <description>SW-WDG debug mode break bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_ENR" -->
        <register>
          <name>INT_ENR</name>
          <description> Interrupt Enable Register [W]</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000027</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSE" -->
            <field>
              <name>FCSE</name>
              <description>Anomalous frequency detection interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCSE" -->
            <field>
              <name>PCSE</name>
              <description>PLL oscillation stabilization completion interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSE" -->
            <field>
              <name>SCSE</name>
              <description>Sub oscillation stabilization completion interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSE" -->
            <field>
              <name>MCSE</name>
              <description>Main oscillation stabilization completion interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_STR" -->
        <register>
          <name>INT_STR</name>
          <description>Interrupt Status Register [W]</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000027</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSI" -->
            <field>
              <name>FCSI</name>
              <description>Anomalous frequency detection interrupt status bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCSI" -->
            <field>
              <name>PCSI</name>
              <description>PLL oscillation stabilization completion interrupt status bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCSI" -->
            <field>
              <name>SCSI</name>
              <description>Sub oscillation stabilization completion interrupt status bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCSI" -->
            <field>
              <name>MCSI</name>
              <description>Main oscillation stabilization completion interrupt status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_CLR" -->
        <register>
          <name>INT_CLR</name>
          <description>Interrupt Clear Register [W]</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000027</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSC" -->
            <field>
              <name>FCSC</name>
              <description>Anomalous frequency detection interrupt cause clear bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PCSC" -->
            <field>
              <name>PCSC</name>
              <description>PLL oscillation stabilization completion interrupt cause clear bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SCSC" -->
            <field>
              <name>SCSC</name>
              <description>Sub oscillation stabilization completion interrupt cause clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MCSC" -->
            <field>
              <name>MCSC</name>
              <description>Main oscillation stabilization completion interrupt cause clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLLCG_CTL" -->
        <register>
          <name>PLLCG_CTL</name>
          <description>PLL Clock Gear Control Register [W]</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00FF0000</resetValue>
          <resetMask>0x00FFFFC3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLCGLP" -->
            <field>
              <name>PLLCGLP</name>
              <description>PLL clock gear step loop configuration bits</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLCGSTP" -->
            <field>
              <name>PLLCGSTP</name>
              <description>PLL clock gear step configuration bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLCGSSN" -->
            <field>
              <name>PLLCGSSN</name>
              <description>PLL clock gear start step number configuration bits</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLCGSTS" -->
            <field>
              <name>PLLCGSTS</name>
              <description>PLL clock gear start bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLCGSTR" -->
            <field>
              <name>PLLCGSTR</name>
              <description>PLL clock gear start bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLCGEN" -->
            <field>
              <name>PLLCGEN</name>
              <description>PLL clock gear enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
