mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/s6e2d3xg.svd
        <!-- REGISTER "MBR0" -->
        <register>
          <name>MBR0</name>
          <description>Memory Base Address Register 0 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MBR" -->
            <field>
              <name>MBR</name>
              <description>Base address for memory space 0</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MBR1" -->
        <register derivedFrom="MBR0">
          <name>MBR1</name>
          <description>Memory Base Address Register 1 [BHW]</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "MCR0" -->
        <register>
          <name>MCR0</name>
          <description>Memory Configuration Register 0 [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00030033</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CRMO" -->
            <field>
              <name>CRMO</name>
              <description>Continuous Read Merging Option</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACS" -->
            <field>
              <name>ACS</name>
              <description>Asymmetry Cache System Support</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRT" -->
            <field>
              <name>CRT</name>
              <description>Configuration Register Target</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEVTYPE" -->
            <field>
              <name>DEVTYPE</name>
              <description>Device Type</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRAPSIZE" -->
            <field>
              <name>WRAPSIZE</name>
              <description>Wrapped Burst Size</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR1" -->
        <register derivedFrom="MCR0">
          <name>MCR1</name>
          <description>Memory Configuration Register 1 [BHW]</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "MTR0" -->
        <register>
          <name>MTR0</name>
          <description>Memory Timing Register 0 [BHW]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCSHI" -->
            <field>
              <name>RCSHI</name>
              <description>Read Chip Select High Between Operations</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCSHI" -->
            <field>
              <name>WCSHI</name>
              <description>Write Chip Select High Between Operations</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCSS" -->
            <field>
              <name>RCSS</name>
              <description>Read Chip Select Setup To Next CK Rising Edge</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCSS" -->
            <field>
              <name>WCSS</name>
              <description>Write Chip Select Setup To Next CK Rising Edge</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCSH" -->
            <field>
              <name>RCSH</name>
              <description>Read Chip Select Hold After CK falling Edge</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCSH" -->
            <field>
              <name>WCSH</name>
              <description>Write Chip Select Hold After CK falling Edge</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LTCY" -->
            <field>
              <name>LTCY</name>
              <description>Latency Cycle for HyperRAM mode</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MTR1" -->
        <register derivedFrom="MTR0">
          <name>MTR1</name>
          <description>Memory Timing Register 1 [BHW]</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "GPOR" -->
        <register>
          <name>GPOR</name>
          <description>General Purpose Output Register [BHW]</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPO1" -->
            <field>
              <name>GPO1</name>
              <description>General Purpose Output Interface</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GPO0" -->
            <field>
              <name>GPO0</name>
              <description>General Purpose Output Interface</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WPR" -->
        <register>
          <name>WPR</name>
          <description>Write Protection Register [BHW]</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WP" -->
            <field>
              <name>WP</name>
              <description>Write Protection</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TEST" -->
        <register>
          <name>TEST</name>
          <description>Test Register [BHW]</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RVD" -->
            <field>
              <name>RVD</name>
              <description>Reserved bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
