mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xg/s6e2d3xg.svd
        <!-- REGISTER "DSP_LOCKUNLOCK" -->
        <register>
          <name>DSP_LOCKUNLOCK</name>
          <description>Display LockUnlock register [W]</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSP_LOCKUNLOCK" -->
            <field>
              <name>DSP_LOCKUNLOCK</name>
              <description>Protection key of this address block setting bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP_LOCKSTATUS" -->
        <register>
          <name>DSP_LOCKSTATUS</name>
          <description>Display Lock Status indication register [W]</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000111</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSP_FREEZESTATUS" -->
            <field>
              <name>DSP_FREEZESTATUS</name>
              <description>Current status of freeze status</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DSP_PRIVILEGESTATUS" -->
            <field>
              <name>DSP_PRIVILEGESTATUS</name>
              <description>Current status of provilege protection</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DSP_LOCKSTATUS" -->
            <field>
              <name>DSP_LOCKSTATUS</name>
              <description>Current status of lock protection</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_CLOCKDIVIDER" -->
        <register>
          <name>DSP0_CLOCKDIVIDER</name>
          <description>Display Clock Divider Ration Setting Register [W]</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0041E000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSP0_CLOCKDIVIDER" -->
            <field>
              <name>DSP0_CLOCKDIVIDER</name>
              <description>Division ration from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_DOMAINCONTROL" -->
        <register>
          <name>DSP0_DOMAINCONTROL</name>
          <description>Display clock domain control register [W]</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSP0_SOFTWARERESET" -->
            <field>
              <name>DSP0_SOFTWARERESET</name>
              <description>Display clock domain software reset</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSP0_CLOCKENABLE" -->
            <field>
              <name>DSP0_CLOCKENABLE</name>
              <description>Display clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_CLOCKSHIFT" -->
        <register>
          <name>DSP0_CLOCKSHIFT</name>
          <description>Register for display clock shift [W]</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00FF0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSP0_CLOCKOFFSET" -->
            <field>
              <name>DSP0_CLOCKOFFSET</name>
              <description>Display clock phase setting bits</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSP0_CLOCKINVERT" -->
            <field>
              <name>DSP0_CLOCKINVERT</name>
              <description>Display clock polarity setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_POWERENCONTROL" -->
        <register>
          <name>DSP0_POWERENCONTROL</name>
          <description>Register for display Power Enable Signal Control [W]</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "POWER_ENABLE" -->
            <field>
              <name>POWER_ENABLE</name>
              <description>Power control of external TFT panel setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_CLOCKGATEMODELOCK" -->
        <register>
          <name>DSP0_CLOCKGATEMODELOCK</name>
          <description>Display Clock Gate Mode Protection Control register [W]</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCKUNLOCK" -->
            <field>
              <name>LOCKUNLOCK</name>
              <description>Protection of this address block setting bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSP0_CLOCKGATECONTROL" -->
        <register>
          <name>DSP0_CLOCKGATECONTROL</name>
          <description>Display Clock Gate Control register [W]</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLOCKGATE_ENABLE" -->
            <field>
              <name>CLOCKGATE_ENABLE</name>
              <description>Dot clock for external TFT panel control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDRAMC_CLOCKDIVIDER" -->
        <register>
          <name>SDRAMC_CLOCKDIVIDER</name>
          <description>Division Ratio of SDRAM interface setting register [W]</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDRAMC_CLOCKDIVIDER" -->
            <field>
              <name>SDRAMC_CLOCKDIVIDER</name>
              <description>Division ratio from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
